Revit 2027 API
ViewSheet.CreatePlaceholder Method
 Creates a placeholder sheet in a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ViewSheet CreatePlaceholder(
	Document aDoc
)
Public Shared Function CreatePlaceholder (
	aDoc As Document
) As ViewSheet
public:
static ViewSheet^ CreatePlaceholder(
	Document^ aDoc
)
static member CreatePlaceholder :
        aDoc : Document -> ViewSheet
Parameters
aDoc Document
 The document.
Return Value
ViewSheet
 The placeholder sheet.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Placeholder sheets represent sheets stored outside of the Revit model, but which should be organized along with the Revit sheets.
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace